Revit 2027 API
BuiltInFailures.ConnectorFailures.NotAllowedToModifyGroupElementsError Property
 Connection to a group failed. Modification of elements within a group is not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotAllowedToModifyGroupElementsError { get; }
Public Shared ReadOnly Property NotAllowedToModifyGroupElementsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotAllowedToModifyGroupElementsError {
	FailureDefinitionId^ get ();
}
static member NotAllowedToModifyGroupElementsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace